Revit 2016 API
IFCAggregate.GetEnumerator Method
Returns an enumerator that iterates through the collection.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
public virtual IEnumerator<IFCData> GetEnumerator()
Visual Basic
Public Overridable Function GetEnumerator As IEnumerator(Of IFCData)
Visual C++
public:
virtual IEnumerator<IFCData^>^ GetEnumerator()
Implements
IEnumerable<T>.GetEnumerator()
See Also
IFCAggregate Class
Autodesk.Revit.DB.IFC Namespace